# 2)

#Control flow ნიშნავს იმას, როგორ მუშაობს პროგრამა და რა რიგით აკეთებს სხვადასხვა რამეებს.

#მთავარი სამი ნაწილი:

#Sequencing – ყველაფერი ხდება რიგრიგობით
#Selection – პროგრამა არჩევს, რომელი გზა აიღოს
#Iteration – ერთი და იგივე ნაწილი მეორდება რამდენიმე ჯერ
#ეს დახმარება აძლევს პროგრამას, რომ სწორად აკეთოს ყველაფერი


# 3)

#ალგორითმი არის  უბრალოდ ნაბიჯები რომლებიც უნდა შევასრულოთ მიზნის მისაღწევად
                                                                                
#სამი გზა :                                                                                   

#ტექსტური – მარტივი სიტყვებით დაწერილი ნაბიჯები.
#გრაფიკული  – სურათით გადმოცემული 
#მათემატიკური  – ფორმულები