# 1 )

# format ფუნქცია არის მეთოდი, რომელიც საშუალებას აძლევს მომხმარებელს შეავსოს სტრინგი კონკრეტული მნიშვნელობებით. ეს ფუნქცია გამოიყენება სტრინგზე, რომელსაც აქვს {} ადგილები, რომლებსაც უნდა მიაწვდონ მნიშვნელობები.
# f-string არის  ფუნქცია, რომელიც საშუალებას აძლევს პირდაპირ სტრინგში ჩაწეროთ ცვლადები და გამოხატულებები {} , როდესაც სტრინგი იწყება f ან F ასოებით.
# f-string უფრო კარგი და მარტივი მიგომმაა
# append და insert ორივე მეთოდი გამოიყენება სიაში ელემენტების დამატებისთვის, მაგრამ მათი მოქმედება განსხვავებულია.

# 2)

def user(age , name):
    return f"welcome your age is {age} and name is {name}"

user_age = int(input("Enter your age: "))
user_name = input("enter your name : ")
iasnia = user(user_age , user_name)
print(iasnia)